app/controllers/categories_controller.rb

  def create
    @category = Category.new(category_params)

    respond_to do |format|
      if @category.save
---
INSERT INTO "categories" ("name", "code", "html", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["name", "Smalltalk"], ["code", "language-code"], ["html", "fa fa-money"], ["created_at", "2018-05-27 21:41:22.881954"], ["updated_at", "2018-05-27 21:41:22.881954"]]

  def update
    respond_to do |format|
      if @category.update(category_params)
---
UPDATE "categories" SET "name" = $1, "code" = $2, "html" = $3, "updated_at" = $4 WHERE "categories"."id" = $5  [["name", "new-name"], ["code", "new-cat-code"], ["html", "fa fa-new-icon"], ["updated_at", "2018-05-27 21:41:22.976115"], ["id", 15]]