app/controllers/main_controller.rb

SELECT "projects".* FROM "projects" WHERE "projects"."sticky" = $1 AND "projects"."displayed" = $2 ORDER BY "projects"."created_at" DESC  [["sticky", "t"], ["displayed", "t"]]
SELECT "projects".* FROM "projects" WHERE "projects"."sticky" != $1 AND "projects"."website" = $2 AND "projects"."displayed" = $3 ORDER BY "projects"."created_at" DESC  [["sticky", true], ["website", true], ["displayed", true]]
SELECT "projects".* FROM "projects" WHERE "projects"."displayed" = $1 AND ("projects"."sticky" = 'f' OR "projects"."sticky" IS NULL) AND ("projects"."website" = 'f' OR "projects"."website" IS NULL) ORDER BY "projects"."categories" ASC  [["displayed", "t"]]
---
	def index
		# @featureBlog = false
		@featureBlog   = ApplicationHelper.isTrue(ENV['BLOG_ENABLE'])
		@featureGithub = ApplicationHelper.isTrue(ENV['GITHUB_ENABLE'])

		# Blog
		if @featureBlog
			postCount = Article.count
			if postCount > 0
				if postCount > 10
					@articlesTop    = Article.first(10)
					@articlesBottom = Article.last(postCount - 10)
				else
					@articlesTop    = Article.all
					@articlesBottom = Article.first(0)
				end

			else
				@articlesTop    = Article.all
				@articlesBottom = Article.all
			end

		end

		# Projects
		@featured = Project.order(created_at: :desc)
			 .where(sticky: true, displayed: true)

		@websites        = Project.order(created_at: :desc)
			 .where.not(sticky: true)
			 .where(website: true)
			 .where(displayed: true)

		@everything = Project.order(categories: :asc)
			 .where(displayed: true)
			 .where(sticky: [false, nil])
			 .where(website: [false, nil])