app/controllers/projects_controller.rb

  def index
    @projectsEnabled = Project.order(order: :DESC).where(displayed: true)
    @projectsDisabled = Project.where(displayed: false)
---
SELECT "projects".* FROM "projects" WHERE "projects"."displayed" = $1 ORDER BY "projects"."order" DESC  [["displayed", "t"]]
SELECT "projects".* FROM "projects" WHERE "projects"."displayed" = $1  [["displayed", "f"]]

  def create
    @project = Project.new(project_params)

    respond_to do |format|
      if @project.save
---
INSERT INTO "projects" ("name", "categories", "order", "displayed", "created_at", "updated_at", "content", "markdown", "image_dir") VALUES ($1, $2, $3, $4, $5, $6, $7, $8, $9) RETURNING "id"

  def update
    respond_to do |format|
      if @project.update(project_params)
---
UPDATE "projects" SET "name" = $1, "content" = $2, "markdown" = $3, "sticky" = $4, "updated_at" = $5 WHERE "projects"."id" = $6  [["name", "new-name"], ["content", "this is new content"], ["markdown", true], ["sticky", true], ["updated_at", "2018-06-20 22:49:53.478029"], ["id", 8]]